# Numpy

In [1]:
import numpy as np
import pandas as pd

### Null values

Numpy has a special "nullable" value for numbers which is np.nan. It's NaN - "Not a number"

In [2]:
np.nan

nan

np.nan is like a virus any array containing np.nan gives unexpected results

In [3]:
a = np.array([1,2,3,np.nan,np.nan,6])

In [4]:
print(a.sum())
print(a.mean())

nan
nan

In [5]:
print(3 + np.nan)
#This better than None value as 3 + None raises an exception

nan

In [6]:
a = np.array([1, 2, 3, np.nan, None, 4], dtype='float')
a #for numeric array None value is replaced by np.nan

array([ 1.,  2.,  3., nan, nan,  4.])

### Infinite values

In [7]:
b = np.array([1,2,3,np.inf,np.nan])

In [8]:
b.sum()

nan

In [9]:
np.inf + 3

inf

### Checking for nan or inf
There are 2 fuctions np.isnan and np.isinf that will perform the desired check

In [10]:
print(np.isnan(a))
print(a[np.isnan(a)])

[False False False  True  True False]
[nan nan]

In [11]:
print(np.isinf(b))
print(b[np.isinf(b)])

[False False False  True False]
[inf]

In [12]:
a[np.isfinite(a)] #ignores np.nan or np.inf values

array([1., 2., 3., 4.])

In [13]:
a[np.isfinite(a)].sum()

10.0

# Pandas
Similar to numpy pandas also has few utility functions to identify and detect null values

In [14]:
print(pd.isnull(np.nan)) #is null indicates if the value is null or not
print(pd.isnull(None))

True
True

In [15]:
print(pd.notnull(np.nan)) #opposite of notnull
print(pd.notnull(3))

False
True

In [16]:
pd.isnull(pd.Series([1, np.nan, 7])) #also works for series

0    False
1     True
2    False
dtype: bool

In [17]:
#and dataframe
pd.isnull(pd.DataFrame({
    'A': [1, np.nan, 7],
    'B': [np.nan, 2, 3],
    'C': [np.nan, 2, np.nan]
}))

       A      B      C
0  False   True   True
1   True  False  False
2  False  False   True

#### In pandas np.nan does not behave as virus
Pandas ignore null values completely

In [18]:
pd.Series([1, 2, np.nan]).count()

2

#### Dropping null values

In [19]:
s = pd.Series([1,2,3,np.nan,np.nan,6])

In [20]:
s.dropna()

0    1.0
1    2.0
2    3.0
5    6.0
dtype: float64

In [21]:
df = pd.DataFrame({
    'A': [1, np.nan, 7],
    'B': [np.nan, 2, 3],
    'C': [np.nan, 2, np.nan]
})

In [22]:
df.shape

(3, 3)

In [23]:
df.info() #here we can see out of 9 values we have 5 notnull values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      float64
 1   B       2 non-null      float64
 2   C       1 non-null      float64
dtypes: float64(3)
memory usage: 200.0 bytes

In [24]:
df.isnull().sum() #here we can null values in each column

A    1
B    1
C    2
dtype: int64

In [25]:
#in dataframes drop function drops all the *rows* which contain null values
df.dropna() #hence we have empty table
#if axis = 1 then it drops *columns*

Empty DataFrame
Columns: [A, B, C]
Index: []

### Filling nulls with arbitrary value

In [26]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    6.0
dtype: float64

In [27]:
#or any statistical function
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    6.0
dtype: float64

In [28]:
#also works with dataframes
df.fillna({'A': 0, 'B': 99, 'C': df['C'].mean()})

     A     B    C
0  1.0  99.0  2.0
1  0.0   2.0  2.0
2  7.0   3.0  2.0

#### Consider a table of gender and age which requires data cleaning

In [29]:
df = pd.DataFrame({
    "Gender": ["M","M","F","Z","?","F"],
    "Age" : [29,18,19,200,23,21]})
df

  Gender  Age
0      M   29
1      M   18
2      F   19
3      Z  200
4      ?   23
5      F   21

Here we have 3 invalid values 2 in Gender and 1 in Age. Lets start with Gender column first

#### First check we can do is Finding Unique values

In [30]:
df["Gender"].unique()

array(['M', 'F', 'Z', '?'], dtype=object)

In [31]:
df["Gender"].value_counts()

M    2
F    2
Z    1
?    1
Name: Gender, dtype: int64

#### Replacing unique values

In [32]:
df["Gender"].replace({"Z":"M","?":"F"})

0    M
1    M
2    F
3    M
4    F
5    F
Name: Gender, dtype: object

In [33]:
df["Age"].replace({200:20}) #inplace = True for permananet changes

0    29
1    18
2    19
3    20
4    23
5    21
Name: Age, dtype: int64

In [34]:
df

  Gender  Age
0      M   29
1      M   18
2      F   19
3      Z  200
4      ?   23
5      F   21

Here we replace 200 with 20 because it can be a typo. A good fix for it is to divide all age values by 10 if they are greater than 100

In [35]:
df.loc[df["Age"]>100,"Age"] = df.loc[df["Age"]>100,"Age"]/10

In [36]:
df

  Gender  Age
0      M   29
1      M   18
2      F   19
3      Z   20
4      ?   23
5      F   21

### Dealing with duplicates

#### In Series

In [37]:
ambassadors = pd.Series([
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
], index=[
    'Gérard Araud',
    'Kim Darroch',
    'Peter Westmacott',
    'Armando Varricchio',
    'Peter Wittig',
    'Peter Ammon',
    'Klaus Scharioth '
])

In [38]:
ambassadors

Gérard Araud                  France
Kim Darroch           United Kingdom
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [39]:
ambassadors[ambassadors.duplicated()] #here it is only considering the values
                                      #entered second as duplicates

Peter Westmacott    United Kingdom
Peter Ammon                Germany
Klaus Scharioth            Germany
dtype: object

In [40]:
ambassadors[ambassadors.duplicated(keep='last')]
#now the last values are not considered to be as duplicates but first are

Kim Darroch     United Kingdom
Peter Wittig           Germany
Peter Ammon            Germany
dtype: object

In [41]:
ambassadors[ambassadors.duplicated(keep=False)] #finds all the duplicate values

Kim Darroch         United Kingdom
Peter Westmacott    United Kingdom
Peter Wittig               Germany
Peter Ammon                Germany
Klaus Scharioth            Germany
dtype: object

In [42]:
#To frop duplicates
ambassadors.drop_duplicates()

Gérard Araud                  France
Kim Darroch           United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
dtype: object

#### In DataFrames

In [43]:
gamers = pd.DataFrame({
    'Name': [
        'Godspeed',
        'Proronvirus',
        'R2D2',
        'Godspeed',
        'Proronvirus',
    ],
    'Rank': [
        'Gold',
        'Bronze',
        'Diamond',
        'Gold',
        'Bronze'
    ]
})
gamers

          Name     Rank
0     Godspeed     Gold
1  Proronvirus   Bronze
2         R2D2  Diamond
3     Godspeed     Gold
4  Proronvirus   Bronze

In [44]:
gamers[gamers.duplicated()]
#here we can say that as they are the same person the rank is also the same

          Name    Rank
3     Godspeed    Gold
4  Proronvirus  Bronze

#### Same rules apply for DataFrames

In [45]:
gamers.drop_duplicates()

          Name     Rank
0     Godspeed     Gold
1  Proronvirus   Bronze
2         R2D2  Diamond

In [46]:
gamers.drop_duplicates(keep="last")

          Name     Rank
2         R2D2  Diamond
3     Godspeed     Gold
4  Proronvirus   Bronze

# Text Handling
Generally data does not make sense it is job of an analyst to make sense of data. Here is a data collected from a servey

In [47]:
df = pd.DataFrame({
    'Data': [
        '1987_M_US _1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_   IT_1',
        '1985_F_I  T_2'
]})
df

              Data
0     1987_M_US _1
1     1990?_M_UK_1
2      1992_F_US_2
3  1970?_M_   IT_1
4    1985_F_I  T_2

In [48]:
#to easily interpret data we split it on the basis of underscroll
df["Data"].str.split("_",expand = True)

       0  1      2  3
0   1987  M    US   1
1  1990?  M     UK  1
2   1992  F     US  2
3  1970?  M     IT  1
4   1985  F   I  T  2

In [49]:
df = df["Data"].str.split("_",expand = True)
#expand = True creates a DataFrame from prev input

#### Now by looking at the data,
we can tell that it contains year, gender, country and maybe no of childern

In [50]:
df.columns = ["Year","Gender","Country","No of Childern"]
df

    Year Gender Country No of Childern
0   1987      M     US               1
1  1990?      M      UK              1
2   1992      F      US              2
3  1970?      M      IT              1
4   1985      F    I  T              2

In [51]:
#spaces can be easily removed by replace function
df['Country'].str.replace(" ","")

0    US
1    UK
2    US
3    IT
4    IT
Name: Country, dtype: object